tutorials/incompressible/pimpleSolver/ras/cavity/0/k
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00325;

boundaryField
{
    movingWall
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform 0.00325;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
